In [2]:
import pandas as pd
import numpy as np

In [14]:
def function1():
    p_array = pd.array([1,2,3,4,5])
    print(f"p_array = \n{p_array} Type = {type(p_array)}")

function1()

p_array =
<IntegerArray>
[1, 2, 3, 4, 5]
Length: 5, dtype: Int64 Type = <class 'pandas.core.arrays.integer.IntegerArray'>

In [13]:
l1 = []
p_array = pd.Series([1,2,3,4,5])
l1 = [p_array]
print(f"p_array = \n{l1} Type = {type(l1)}")

p_array =
[0    1
1    2
2    3
3    4
4    5
dtype: int64] Type = <class 'list'>

In [27]:
s1 = pd.Series([1,2,3,4,5,6])
s2 = pd.Series([6,7,8,9,10,11])
print("Addition : ")
s = s1+s2
print(s)
print("Substraction : ")
s = s1-s2
print(s)
print("Multiplication : ")
s = s1*s2
print(s)
print("Division : ")
s = s1/s2
print(s)

Addition :
0     7
1     9
2    11
3    13
4    15
5    17
dtype: int64
Substraction :
0   -5
1   -5
2   -5
3   -5
4   -5
5   -5
dtype: int64
Multiplication :
0     6
1    14
2    24
3    36
4    50
5    66
dtype: int64
Division :
0    0.166667
1    0.285714
2    0.375000
3    0.444444
4    0.500000
5    0.545455
dtype: float64

In [33]:
s = ["Name", "Organization", "Cource"]
p_series = pd.Series(["Sourabh","Sunbeam","PG-DESD"],index = s)
print(p_series)

Name            Sourabh
Organization    Sunbeam
Cource          PG-DESD
dtype: object

In [35]:
np = np.array([1,2,3,4,5])
pd = pd.Series(np)
print(pd)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [53]:
    #Question : 6
    s1 = pd.Series([1,2,3,4,5])
    arr= np.array(s1,dtype=np.float16)
    print(f"Dtype = {arr.dtype}")

Dtype = float16

In [55]:
#Question : 7
s1 = pd.Series([1,2,3,4,5])
arr= np.array(s1,dtype=np.float16)
print(f"{arr}")

[1. 2. 3. 4. 5.]

In [62]:
#Question : 8
p1 = ({"Name":"Sourabh","Org":"Sunbeam","Cource":"PG-DESD","Degree":"BE"})
p2 = ({"Name":"Nikhil","Org":"Sunbeam","Cource":"PG-DMC","Degree":"BA"})
p3 = ({"Name":"Jittendra","Org":"Sunbeam","Cource":"PG-DAC","Degree":"ME++"})

s1 = pd.Series(p1)
s2 = pd.Series(p2)
s3 = pd.Series(p3)
student = pd.DataFrame([s1,s2,s3])
print(student)

        Name      Org   Cource Degree
0    Sourabh  Sunbeam  PG-DESD     BE
1     Nikhil  Sunbeam   PG-DMC     BA
2  Jittendra  Sunbeam   PG-DAC   ME++

In [20]:
#Question : 9
l1 = ["EMPId","Name", "Organization", "Cource"]
p1 = pd.Series(["101","Sourabh","Sunbeam","PG-DESD"],index = l1)
p2 = pd.Series(["102","Nikhil","Sunbeam","PG-DMC"],index = l1)
p3 = pd.Series(["103","Jittendra","Sunbeam","PG-DAC"],index = l1)
p4 = pd.Series(["104","Priyansh","Sunbeam","PG-DESD"],index = l1)
p5 = pd.Series(["105","Kartik","Sunbeam","PG-DMC"],index = l1)
p6 = pd.Series(["106","Snehal","Sunbeam","PG-DAC"],index = l1)
p7 = pd.Series(["107","Muskan","Sunbeam","PG-DESD"],index = l1)
p8 = pd.Series(["108","Bharat","Sunbeam","PG-DMC"],index = l1)
p9 = pd.Series(["109","Divya","Sunbeam","PG-DAC"],index = l1)
p10 = pd.Series(["110","Atharva","Sunbeam","PG-DMC"],index = l1)

print(f"Type = {type(l1)}")

Employee = pd.DataFrame([p1,p2,p3,p4,p5,p6,p7,p8,p9,p10])

print(Employee)

Type = <class 'list'>
  EMPId       Name Organization   Cource
0   101    Sourabh      Sunbeam  PG-DESD
1   102     Nikhil      Sunbeam   PG-DMC
2   103  Jittendra      Sunbeam   PG-DAC
3   104   Priyansh      Sunbeam  PG-DESD
4   105     Kartik      Sunbeam   PG-DMC
5   106     Snehal      Sunbeam   PG-DAC
6   107     Muskan      Sunbeam  PG-DESD
7   108     Bharat      Sunbeam   PG-DMC
8   109      Divya      Sunbeam   PG-DAC
9   110    Atharva      Sunbeam   PG-DMC

In [9]:
Employee.head()

  EMPId       Name Organization   Cource
0   101    Sourabh      Sunbeam  PG-DESD
1   102     Nikhil      Sunbeam   PG-DMC
2   103  Jittendra      Sunbeam   PG-DAC
3   104   Priyansh      Sunbeam  PG-DESD
4   105     Kartik      Sunbeam   PG-DMC

In [10]:
Employee.tail()

  EMPId     Name Organization   Cource
5   106   Snehal      Sunbeam   PG-DAC
6   107   Muskan      Sunbeam  PG-DESD
7   108   Bharat      Sunbeam   PG-DMC
8   109    Divya      Sunbeam   PG-DAC
9   110  Atharva      Sunbeam   PG-DMC

In [11]:

    print("First Two records")
    Employee.head(2)

First Two records

  EMPId     Name Organization   Cource
0   101  Sourabh      Sunbeam  PG-DESD
1   102   Nikhil      Sunbeam   PG-DMC

In [12]:
    print("Last Two records")
    Employee.tail(2)

Last Two records

  EMPId     Name Organization  Cource
8   109    Divya      Sunbeam  PG-DAC
9   110  Atharva      Sunbeam  PG-DMC

In [13]:
Employee.iloc[4]

EMPId               105
Name             Kartik
Organization    Sunbeam
Cource           PG-DMC
Name: 4, dtype: object

In [14]:
Employee.iloc[3]

EMPId                104
Name            Priyansh
Organization     Sunbeam
Cource           PG-DESD
Name: 3, dtype: object

In [15]:
Employee.to_csv('Employee')

In [17]:
#Question 10 A
pd.read_csv('Employee')

   Unnamed: 0  EMPId       Name Organization   Cource
0           0    101    Sourabh      Sunbeam  PG-DESD
1           1    102     Nikhil      Sunbeam   PG-DMC
2           2    103  Jittendra      Sunbeam   PG-DAC
3           3    104   Priyansh      Sunbeam  PG-DESD
4           4    105     Kartik      Sunbeam   PG-DMC
5           5    106     Snehal      Sunbeam   PG-DAC
6           6    107     Muskan      Sunbeam  PG-DESD
7           7    108     Bharat      Sunbeam   PG-DMC
8           8    109      Divya      Sunbeam   PG-DAC
9           9    110    Atharva      Sunbeam   PG-DMC

In [22]:
#Question 10 B
Employee['Salary']=[1000,2000,3000,4000,5000,6000,7000,8000,9000,10000]
print(Employee)

  EMPId       Name Organization   Cource  Salary
0   101    Sourabh      Sunbeam  PG-DESD    1000
1   102     Nikhil      Sunbeam   PG-DMC    2000
2   103  Jittendra      Sunbeam   PG-DAC    3000
3   104   Priyansh      Sunbeam  PG-DESD    4000
4   105     Kartik      Sunbeam   PG-DMC    5000
5   106     Snehal      Sunbeam   PG-DAC    6000
6   107     Muskan      Sunbeam  PG-DESD    7000
7   108     Bharat      Sunbeam   PG-DMC    8000
8   109      Divya      Sunbeam   PG-DAC    9000
9   110    Atharva      Sunbeam   PG-DMC   10000

In [23]:
print(Employee.columns)

Index(['EMPId', 'Name', 'Organization', 'Cource', 'Salary'], dtype='object')

In [37]:
#Question 11
#i
df = pd.read_csv('Advertising.csv')

In [38]:
# ii
df.head()

      TV  radio  newspaper  sales
0  230.1   37.8       69.2   22.1
1   44.5   39.3       45.1   10.4
2   17.2   45.9       69.3    9.3
3  151.5   41.3       58.5   18.5
4  180.8   10.8       58.4   12.9

In [39]:
#iii
df.tail()

        TV  radio  newspaper  sales
195   38.2    3.7       13.8    7.6
196   94.2    4.9        8.1    9.7
197  177.0    9.3        6.4   12.8
198  283.6   42.0       66.2   25.5
199  232.1    8.6        8.7   13.4

In [40]:
#iv
df.columns

Index(['TV', 'radio', 'newspaper', 'sales'], dtype='object')

In [41]:
#v
df.tail(3)

        TV  radio  newspaper  sales
197  177.0    9.3        6.4   12.8
198  283.6   42.0       66.2   25.5
199  232.1    8.6        8.7   13.4

In [42]:
#vi
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   TV         200 non-null    float64
 1   radio      200 non-null    float64
 2   newspaper  200 non-null    float64
 3   sales      200 non-null    float64
dtypes: float64(4)
memory usage: 6.4 KB

In [43]:
#xii and xiii
df.describe()

               TV       radio   newspaper       sales
count  200.000000  200.000000  200.000000  200.000000
mean   147.042500   23.264000   30.554000   14.022500
std     85.854236   14.846809   21.778621    5.217457
min      0.700000    0.000000    0.300000    1.600000
25%     74.375000    9.975000   12.750000   10.375000
50%    149.750000   22.900000   25.750000   12.900000
75%    218.825000   36.525000   45.100000   17.400000
max    296.400000   49.600000  114.000000   27.000000

In [62]:
df.shape

(200, 5)

In [45]:
#xi
df.shape

(200, 4)

In [48]:
# x
df['updated_sales'] = df['sales'] + df['sales']*0.10 
print(df)

        TV  radio  newspaper  sales  updated_sales
0    230.1   37.8       69.2   22.1          24.31
1     44.5   39.3       45.1   10.4          11.44
2     17.2   45.9       69.3    9.3          10.23
3    151.5   41.3       58.5   18.5          20.35
4    180.8   10.8       58.4   12.9          14.19
..     ...    ...        ...    ...            ...
195   38.2    3.7       13.8    7.6           8.36
196   94.2    4.9        8.1    9.7          10.67
197  177.0    9.3        6.4   12.8          14.08
198  283.6   42.0       66.2   25.5          28.05
199  232.1    8.6        8.7   13.4          14.74

[200 rows x 5 columns]

In [61]:
# ix
df.drop(['radio'],axis = 1)

        TV  newspaper  sales  updated_sales
0    230.1       69.2   22.1          24.31
1     44.5       45.1   10.4          11.44
2     17.2       69.3    9.3          10.23
3    151.5       58.5   18.5          20.35
4    180.8       58.4   12.9          14.19
..     ...        ...    ...            ...
195   38.2       13.8    7.6           8.36
196   94.2        8.1    9.7          10.67
197  177.0        6.4   12.8          14.08
198  283.6       66.2   25.5          28.05
199  232.1        8.7   13.4          14.74

[200 rows x 4 columns]

In [63]:
df.to_csv('Advertising')

In [64]:
print(df)

        TV  radio  newspaper  sales  updated_sales
0    230.1   37.8       69.2   22.1          24.31
1     44.5   39.3       45.1   10.4          11.44
2     17.2   45.9       69.3    9.3          10.23
3    151.5   41.3       58.5   18.5          20.35
4    180.8   10.8       58.4   12.9          14.19
..     ...    ...        ...    ...            ...
195   38.2    3.7       13.8    7.6           8.36
196   94.2    4.9        8.1    9.7          10.67
197  177.0    9.3        6.4   12.8          14.08
198  283.6   42.0       66.2   25.5          28.05
199  232.1    8.6        8.7   13.4          14.74

[200 rows x 5 columns]

In [58]:
# viii
df.isna().sum()

TV               0
radio            0
newspaper        0
sales            0
updated_sales    0
dtype: int64

In [54]:
# vii

datatypes = df.dtypes
print(datatypes)

TV               float64
radio            float64
newspaper        float64
sales            float64
updated_sales    float64
dtype: object

In [65]:
# Question 12
# i
Salaries = pd.read_csv('Salary_Data.csv')

In [66]:
print(Salaries)

    YearsExperience  Salary
0               1.1   39343
1               1.3   46205
2               1.5   37731
3               2.0   43525
4               2.2   39891
5               2.9   56642
6               3.0   60150
7               3.2   54445
8               3.2   64445
9               3.7   57189
10              3.9   63218
11              4.0   55794
12              4.0   56957
13              4.1   57081
14              4.5   61111
15              4.9   67938
16              5.1   66029
17              5.3   83088
18              5.9   81363
19              6.0   93940
20              6.8   91738
21              7.1   98273
22              7.9  101302
23              8.2  113812
24              8.7  109431
25              9.0  105582
26              9.5  116969
27              9.6  112635
28             10.3  122391
29             10.5  121872
30             11.0  140000
31             12.0  155000
32             13.0  156000

In [67]:
# ii
Salaries.head()

   YearsExperience  Salary
0              1.1   39343
1              1.3   46205
2              1.5   37731
3              2.0   43525
4              2.2   39891

In [68]:
# iii
Salaries.head(10)

   YearsExperience  Salary
0              1.1   39343
1              1.3   46205
2              1.5   37731
3              2.0   43525
4              2.2   39891
5              2.9   56642
6              3.0   60150
7              3.2   54445
8              3.2   64445
9              3.7   57189

In [70]:
# iv
Salaries.tail()

    YearsExperience  Salary
28             10.3  122391
29             10.5  121872
30             11.0  140000
31             12.0  155000
32             13.0  156000

In [71]:
# v
Salaries.tail(10)

    YearsExperience  Salary
23              8.2  113812
24              8.7  109431
25              9.0  105582
26              9.5  116969
27              9.6  112635
28             10.3  122391
29             10.5  121872
30             11.0  140000
31             12.0  155000
32             13.0  156000

In [73]:
# vi
Salaries.columns

Index(['YearsExperience', 'Salary'], dtype='object')

In [74]:
# vii
Salaries.shape

(33, 2)

In [75]:
# viii and xi

Salaries.describe()

       YearsExperience         Salary
count        33.000000      33.000000
mean          5.921212   82760.303030
std           3.342413   34014.620992
min           1.100000   37731.000000
25%           3.200000   56957.000000
50%           5.100000   67938.000000
75%           8.700000  109431.000000
max          13.000000  156000.000000

In [76]:
# ix
Salaries.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 33 entries, 0 to 32
Data columns (total 2 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   YearsExperience  33 non-null     float64
 1   Salary           33 non-null     int64
dtypes: float64(1), int64(1)
memory usage: 656.0 bytes

In [79]:
# x
datatype = Salaries.dtypes
print(datatype)

YearsExperience    float64
Salary               int64
dtype: object